"""При выполнении дз использовать Git (делать коммиты, работать в dev ветке,
для каждой задачи отдельная ветка из dev ветки и потом делать merge в dev ветку,
после выполнения всех заданий сделать merge develop в master)
1. Пользователь вводит с клавиатуры три числа.
В зависимости от выбора пользователя программа выводит на экран
максимум из трёх, минимум из трёх или среднеарифметическое трёх чисел.
2. Пользователь вводит с клавиатуры количество метров.
В зависимости от выбора пользователя программа переводит
метры в мили, дюймы или ярды.
3. Пользователь вводит с клавиатуры номер дня недели (1-7).
Необходимо вывести на экран названия дня недели.
Например, если 1, то на экране надпись понедельник, 2 — вторник и т.д.
4. Пользователь вводит два числа.
Определить, равны ли эти числа, и, если нет,
вывести их на экран в порядке возрастания
Пример с пары ниже.
Прислать архив с проектом польностью чтоб можно было проверить вашу работу с git.
"""